OdDAI.Binary.setMemory(OdArray&lt;System.Byte,OdObjectsAllocator&lt;System.Byte&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a memory buffer to Binary.
\param newBuffer [in] a memory buffer with new data to set.

OdDAI.Binary.getMemory(OdArray&lt;System.Byte,OdObjectsAllocator&lt;System.Byte&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets a Binary internal data represented as memory.
\param memoryBuffer [out] a buffer for filling.

OdDAI.Binary.#ctor(OdDAI.Binary!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new Binary instance. Copy constructor.

OdDAI.Binary
\details
A class that implements the EXPRESS BINARY data type within IFC Standard Data Access Interface (SDAI).